test/fixtures/xml/ups/pickup_request_raw.xml

<envr:Envelope xmlns:envr="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:common="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0" xmlns:wsf="http://www.ups.com/schema/wsf" xmlns:upss="http://www.ups.com/XMLSchema/XOLTWS/UPSS/v1.0">
  <envr:Header>
    <upss:UPSSecurity>
      <upss:UsernameToken>
        <upss:Username>sven.crone</upss:Username>
        <upss:Password>Holaups2014</upss:Password>
      </upss:UsernameToken>
      <upss:ServiceAccessToken>
        <upss:AccessLicenseNumber>0CCCCED94B9FB025</upss:AccessLicenseNumber>
      </upss:ServiceAccessToken>
    </upss:UPSSecurity>
    <common:ClientInformation>
      <common:Property Key="DataSource">AG</common:Property>
      <common:Property Key="ClientCode">APS</common:Property>
    </common:ClientInformation>
  </envr:Header>
  <envr:Body>
    <PickupCreationRequest xmlns="http://www.ups.com/XMLSchema/XOLTWS/Pickup/v1.1" xmlns:common="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
      <common:Request>
        <common:RequestOption/>
        <common:TransactionReference>
          <common:CustomerContext>d9 Different Client-- shipper account payment method -</common:CustomerContext>
        </common:TransactionReference>
      </common:Request>
      <RatePickupIndicator>N</RatePickupIndicator>
      <Shipper>
        <Account>
          <AccountNumber>0VR893</AccountNumber>
          <AccountCountryCode>MX</AccountCountryCode>
        </Account>
      </Shipper>
      <PickupDateInfo>
        <CloseTime>1600</CloseTime>
        <ReadyTime>0800</ReadyTime>
        <PickupDate>20141125</PickupDate>
      </PickupDateInfo>
      <PickupAddress>
        <CompanyName>Pickup Proxy</CompanyName>
        <ContactName>Pickup Manager</ContactName>
        <AddressLine>315 Saddle Bridge Drive</AddressLine>
        <City>Allendale</City>
        <StateProvince>DF</StateProvince>
        <Urbanization/>
        <PostalCode>11550</PostalCode>
        <CountryCode>MX</CountryCode>
        <ResidentialIndicator>Y</ResidentialIndicator>
        <Phone>
          <Number>6785851399</Number>
        </Phone>
      </PickupAddress>
      <AlternateAddressIndicator>Y</AlternateAddressIndicator>
      <PaymentMethod>01</PaymentMethod>
      <SpecialInstruction>Jia's Test </SpecialInstruction>
      <ReferenceNumber>CreatePickupRef--Jia</ReferenceNumber>
      <CSR>
        <ProfileId>1-Q83-122</ProfileId>
        <ProfileCountryCode>US</ProfileCountryCode>
      </CSR>
    </PickupCreationRequest>
  </envr:Body>
</envr:Envelope>